#pragma once
#include <vector>

using namespace std;

// 问题待定：
/*
sxxx：xxx
*/

/*
模板题：
1.用两个队列实现栈，或用一个队列实现栈，环形结构，纯考察数据结构理解，无实际应用价值，每次入队都是O(n)：225

*/

// 字典树（Trie）：基础 + 进阶 + 字典树优化DP + 0-1字典树（异或字典树）

// 【6.1】基础 (1)
// 
/*
208.
*/
// ---------------------


// ---------------------
// 【6.1】基础 (1)
// 
/*
208.
*/
// ---------------------


// ---------------------
// 【6.1】基础 (1)
// 
/*
208.
*/
// ---------------------


// ---------------------
// 【6.1】基础 (1)
// 
/*
208.
*/
// ---------------------


// ---------------------